In [1]:
import pandas as pd    #pandas - panel data

## Series - 1D dataset

In [4]:
## Creating empty series
d=pd.Series(dtype=float)   #we can also use d=pd.Series()

In [5]:
d

Series([], dtype: float64)

In [6]:
type(d)

pandas.core.series.Series

In [14]:
## Creating series with one element
d=pd.Series(17)

In [15]:
d

0    17
dtype: int64

In [16]:
## Creating series using tuple
t=(10,11,12)
d=pd.Series(t)
d

0    10
1    11
2    12
dtype: int64

In [18]:
## Creating series using list
d=pd.Series([45,78,56,445,78])

In [19]:
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [20]:
## Creating series with array
import numpy as np
arr=np.array([1,2,3,4])
d1=pd.Series(arr)
d1

0    1
1    2
2    3
3    4
dtype: int32

In [21]:
arr2=np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

## Cannot use 2D array to convert into 2D pandas Series

In [22]:
s2=pd.Series(arr2)

ValueError: Data must be 1-dimensional

In [ ]:
## Using dictionary
d={"a":1, "b":2, "c":3, "d":4}

In [24]:
d.values()

TypeError: 'numpy.ndarray' object is not callable

In [25]:
d.keys()

RangeIndex(start=0, stop=5, step=1)

In [26]:
d["c"]

KeyError: 'c'

In [27]:
b=pd.Series()

C:\Users\anura\AppData\Local\Temp\ipykernel_12188\2185733572.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  b=pd.Series()

In [28]:
b

Series([], dtype: float64)

In [30]:
## SLicing operation
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d

0       1
1       2
2       3
3       5
4      47
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [31]:
d[0:9]

0     1
1     2
2     3
3     5
4    47
5    98
6     7
7     8
8     6
dtype: int64

In [32]:
d[[4,5,3,6]] ##multiple index

4    47
5    98
3     5
6     7
dtype: int64

In [33]:
d[4]=34

In [34]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [35]:
d[6:10]=[100,200,300,999]

In [36]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6     100
7     200
8     300
9     999
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [37]:
import numpy as np
import pandas as pd

In [39]:
arr3=np.array([1,2,4,6])
s=pd.Series(arr3,index=["One","Two","Three","Four"])
s

One      1
Two      2
Three    4
Four     6
dtype: int32

## DataFrame

In [43]:
## empty dataframe
d=pd.DataFrame()   ##We can even convert 2D dataframe into 2D dataframe

In [44]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [45]:
type(d)

pandas.core.frame.DataFrame

In [46]:
data=[["abc",1],["def",2],["ghi",3],["hij"],["klm","5"]]

In [47]:
data

[['abc', 1], ['def', 2], ['ghi', 3], ['hij'], ['klm', '5']]

In [48]:
d=pd.DataFrame(data,columns=["A","B"],index=["A","B","C","D","E"]) #converts a nested list into dataframe

In [49]:
import pandas as pd
import numpy as np

In [50]:
d

     A     B
A  abc     1
B  def     2
C  ghi     3
D  hij  None
E  klm     5

In [2]:
## dataframe using dictionary
data={"name":["a","b","c","d","e","f"],"age":[45,12,48,25,12,9]}

In [3]:
d=pd.DataFrame(data)
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f    9

In [ ]:
d.columns

In [4]:
import pandas as pd
import numpy as np

In [5]:
d.columns=["Candidate","age"]

In [6]:
d

  Candidate  age
0         a   45
1         b   12
2         c   48
3         d   25
4         e   12
5         f    9

In [9]:
d.rename({"age":"Age_in_years"},axis=1)   #in python rows=0, columns=1

  Candidate  Age_in_years
0         a            45
1         b            12
2         c            48
3         d            25
4         e            12
5         f             9

In [10]:
d   # therefore not a permanent change

  Candidate  age
0         a   45
1         b   12
2         c   48
3         d   25
4         e   12
5         f    9

In [14]:
#Make the following changes in the code to make a permanent change
d.rename({"age":"Age_in_years"},axis=1,inplace=True)
d

  Candidate  Age_in_years
0         a            45
1         b            12
2         c            48
3         d            25
4         e            12
5         f             9

In [15]:
## Accessing the elemets from dataframe
data=[["Alex",10,"Maths"],["Bob",12,"Science"],["Kelly",15,"Eco"],
     ["Boris",14,"Geo"],["Ken",18,"English"]]

In [16]:
data

[['Alex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [17]:
d=pd.DataFrame(data,columns=["Name","Age","Subject"])

In [18]:
d

    Name  Age  Subject
0   Alex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [25]:
d.iloc[2:4,1:]  #Index location

   Age Subject
2   15     Eco
3   14     Geo

In [26]:
d.columns=["Na me", "Age","Subject"]

In [27]:
d

   Na me  Age  Subject
0   Alex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [29]:
d.Age

0    10
1    12
2    15
3    14
4    18
Name: Age, dtype: int64

In [30]:
d.Subject

0      Maths
1    Science
2        Eco
3        Geo
4    English
Name: Subject, dtype: object

In [31]:
d.Na me   #we cannot access teh column because of space

SyntaxError: invalid syntax (153630680.py, line 1)

In [33]:
d["Na me"]  #Use this method instead when you have space in between

0     Alex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Na me, dtype: object

In [34]:
d[["Subject", "Na me"]]

   Subject  Na me
0    Maths   Alex
1  Science    Bob
2      Eco  Kelly
3      Geo  Boris
4  English    Ken

In [35]:
d

   Na me  Age  Subject
0   Alex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [37]:
d["Subject"][2]="Economics"  # replacing Eco with Economics

C:\Users\anura\AppData\Local\Temp\ipykernel_212\3756851423.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d["Subject"][2]="Economics"  # replacing Eco with Economics

In [38]:
d

   Na me  Age    Subject
0   Alex   10      Maths
1    Bob   12    Science
2  Kelly   15  Economics
3  Boris   14        Geo
4    Ken   18    English

In [39]:
d["Age"][3]=17

C:\Users\anura\AppData\Local\Temp\ipykernel_212\4031956048.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d["Age"][3]=17

In [40]:
d

   Na me  Age    Subject
0   Alex   10      Maths
1    Bob   12    Science
2  Kelly   15  Economics
3  Boris   17        Geo
4    Ken   18    English

In [41]:
d.iloc[0,0]="ALEX"

In [42]:
d

   Na me  Age    Subject
0   ALEX   10      Maths
1    Bob   12    Science
2  Kelly   15  Economics
3  Boris   17        Geo
4    Ken   18    English

In [44]:
d["Gender"]="Male" #initialize and add a new column to the DataFrame
d

   Na me  Age    Subject Gender
0   ALEX   10      Maths   Male
1    Bob   12    Science   Male
2  Kelly   15  Economics   Male
3  Boris   17        Geo   Male
4    Ken   18    English   Male

In [45]:
d["Age"] = d["Age"] - 1
d

   Na me  Age    Subject Gender
0   ALEX    9      Maths   Male
1    Bob   11    Science   Male
2  Kelly   14  Economics   Male
3  Boris   16        Geo   Male
4    Ken   17    English   Male

In [50]:
d.loc[[1,3],["Age","Subject"]]   #Returns the result of the specified rows and columns
#for .loc we can use the index number and column name

   Age  Subject
1   11  Science
3   16      Geo

In [53]:
d.iloc[:,[0,1]] # Index location 
# for .iloc we have to use indices for both rows and columns

   Na me  Age
0   ALEX    9
1    Bob   11
2  Kelly   14
3  Boris   16
4    Ken   17

In [60]:
d.iloc[[3,1],[0,1]]

   Na me  Age
3  Boris   16
1    Bob   11

In [61]:
d.iloc[1]

Na me          Bob
Age             11
Subject    Science
Gender        Male
Name: 1, dtype: object

In [62]:
d

   Na me  Age    Subject Gender
0   ALEX    9      Maths   Male
1    Bob   11    Science   Male
2  Kelly   14  Economics   Male
3  Boris   16        Geo   Male
4    Ken   17    English   Male

In [63]:
## to access the single element we use iloc it will always work with index
## loc used for locating with column names

In [65]:
d.iloc[:2,0]=["abc","xyz"]

In [66]:
d

   Na me  Age    Subject Gender
0    abc    9      Maths   Male
1    xyz   11    Science   Male
2  Kelly   14  Economics   Male
3  Boris   16        Geo   Male
4    Ken   17    English   Male

In [70]:
# Modify multiple values
d.iloc[:2,0] = ["abc","xyz"]

In [71]:
d.iloc[:,1]

0     9
1    11
2    14
3    16
4    17
Name: Age, dtype: int64

In [72]:
d["Age"]

0     9
1    11
2    14
3    16
4    17
Name: Age, dtype: int64

In [73]:
d.loc[:,"Age"]

0     9
1    11
2    14
3    16
4    17
Name: Age, dtype: int64

In [74]:
d

   Na me  Age    Subject Gender
0    abc    9      Maths   Male
1    xyz   11    Science   Male
2  Kelly   14  Economics   Male
3  Boris   16        Geo   Male
4    Ken   17    English   Male

In [75]:
d.loc[3]

Na me      Boris
Age           16
Subject      Geo
Gender      Male
Name: 3, dtype: object

In [76]:
d.iloc[:,[1,2]]

   Age    Subject
0    9      Maths
1   11    Science
2   14  Economics
3   16        Geo
4   17    English

In [77]:
d.iloc[:3,1:3]

   Age    Subject
0    9      Maths
1   11    Science
2   14  Economics